app/controllers/movies_controller.rb

INSERT INTO "movies" ("avatar", "created_at", "description", "director", "poster_image_url", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @movie = Movie.new(movie_params)

        if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "movies" SET "avatar" = ?, "updated_at" = ? WHERE "movies"."id" = 3  [["avatar", "shawnShank.jpg"], ["updated_at", Thu, 04 Feb 2016 06:21:57 UTC +00:00]]
---
    def update
        @movie = Movie.find(params[:id])

        if @movie.update_attributes(movie_params)